---
kind: method
id: M:Autodesk.Revit.DB.DWFImportOptions.#ctor(Autodesk.Revit.DB.DWFImportOptions)
source: html/0b47493c-d4a7-ddd1-5521-870e10a65c4f.htm
---
# Autodesk.Revit.DB.DWFImportOptions.#ctor Method

Constructs a new instance of DWFImportOptions as a copy of the import options.

## Syntax (C#)
```csharp
public DWFImportOptions(
	DWFImportOptions option
)
```

## Parameters
- **option** (`Autodesk.Revit.DB.DWFImportOptions`) - The options to be copied.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null